# IsReadOnly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle..::..IsReadOnly Property
TableCellStyle Class See Also
---
Gets or sets whether this cell is read only.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsReadOnly { get; set; }
```

Visual Basic
---
```text
Public Property IsReadOnly As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsReadOnly {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
true if this cell is read only; otherwise false.
# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace